lwhsu/freebsd-src/usr.bin/ctfdiff/ctfdiff.1
.\"-
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2024 ShengYi Hung <aokblast@FreeBSD.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"

.Dd December 25, 2024
.Dt CTFDIFF 1
.Os
.Sh NAME
.Nm ctfdiff
.Nd compare the SUNW_ctf section of two ELF files
.Sh SYNOPSIS
.Nm
.Op Fl f-ignore-const
.Ar file1
.Ar file2
.Nm
.Cm abi-check
.Fl -base Ar base
.Fl -new Ar new
.Fl -type Ar type
.Op Fl -type Ar type
.Op Fl -types-file Ar path
.Op Fl -json
.Op Fl -max-reasons Ar n
.Sh DESCRIPTION
The
.Nm
utility compare the contents of the CTF (Compact C Type Format) data section
(SUNW_ctf) present in two ELF binary files.
This section was previously created with
.Xr ctfconvert 1
or
.Xr ctfmerge 1 .
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl f-ignore-const
Ignore
.Dv const
qualifiers when comparing types.
.El
.Pp
The
.Cm abi-check
subcommand compares ABI slot compatibility in a directional manner from
BASE to NEW for the requested types.
The following options are available:
.Bl -tag -width indent
.It Fl -base Ar base
Base ELF file to compare against.
.It Fl -new Ar new
New ELF file to check for compatibility.
.It Fl -type Ar type
Type name to check (repeatable).
For example,
.Qq struct bio .
.It Fl -types-file Ar path
Read type names from a file, one per line.
.It Fl -json
Emit machine-readable JSON output.
.It Fl -max-reasons Ar n
Limit the number of breaking reasons reported per type (default 20).
.El
.Sh EXIT STATUS
.Bl -tag -width indent
.It 0
All requested types are compatible.
.It 1
At least one type is incompatible.
.It 2
Usage or tool error (missing files, CTF parse failure, etc.).
.It 3
At least one type is unknown due to missing or insufficient info.
.El
.Sh SEE ALSO
.Xr ctfconvert 1 ,
.Xr ctfmerge 1 ,
.Xr ctfdump 1 ,
.Xr ctf 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 15.0 .
.Sh AUTHORS
ShengYi Hung <aokblast@FreeBSD.org>
The CTF utilities came from OpenSolaris.
